Revit 2026 API

# FormUtilsCanBeDissolved Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool CanBeDissolved(
	Document ADoc,
	ICollection<ElementId> elements
)
```
```vb
Public Shared Function CanBeDissolved (
	ADoc As Document,
	elements As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
static bool CanBeDissolved(
	Document^ ADoc,
	ICollection<ElementId^>^ elements
)
```
```fsharp
static member CanBeDissolved :
        ADoc : Document *
        elements : ICollection<ElementId> -> bool
```

#### Parameters

ADoc Document

elements ICollectionElementId

#### Return Value

Boolean

#### Reference

FormUtils Class

Autodesk.Revit.DB Namespace